src/cf/Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>196</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/ФормаВыбораОбъектаМетаданных/Ext/Form/Module.bsl
&НаКлиенте
Процедура Выбрать(Команда)
	Ссылка=НайтиСсылку(Элементы.дзМетаданные.ТекущаяСтрока);
	Если Ссылка=Неопределено Тогда Возврат; КонецЕсли;
	ЭтаФорма.Закрыть(Ссылка);
КонецПроцедуры

&НаСервере
Функция НайтиСсылку(ИдентификаторСтроки)
	ТекущиеДанные=дзМетаданные.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если ТекущиеДанные=Неопределено Тогда Возврат Неопределено; КонецЕсли;
	Если ТекущиеДанные.ПолучитьРодителя()=Неопределено Тогда Возврат Неопределено; КонецЕсли;
	Возврат Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", ТекущиеДанные.Идентификатор);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий табличного поля "дзМетаданные";

&НаКлиенте
Процедура дзМетаданные_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать(Неопределено);
КонецПроцедуры

Процедура дзМетаданные_ДобавитьСтроку(Ветка, Идентификатор, Представление, Иконка)
	НоваяСтрока=Ветка.ПолучитьЭлементы().Добавить();
	НоваяСтрока.Идентификатор=Идентификатор;
	НоваяСтрока.Представление=Представление;
	НоваяСтрока.Иконка=Иконка;
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("ОбъектыМетаданных") Тогда Возврат; Отказ=Истина; КонецЕсли;
	
	Для каждого СтрокаКоллекции1 Из Параметры.ОбъектыМетаданных Цикл
		Если Метаданные[СтрокаКоллекции1.Значение].Количество()=0 Тогда Продолжить; КонецЕсли; 
		Ветка=дзМетаданные.ПолучитьЭлементы().Добавить();
		Ветка.Идентификатор=СтрокаКоллекции1.Значение;
		Ветка.Представление=СтрокаКоллекции1.Представление;
		Ветка.Иконка=СтрокаКоллекции1.Картинка;
		Для каждого СтрокаКоллекции2 Из Метаданные[СтрокаКоллекции1.Значение] Цикл			
			дзМетаданные_ДобавитьСтроку(Ветка, СтрокаКоллекции2.ПолноеИмя(), СтрокаКоллекции2.Представление(), Ветка.Иконка);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
